C:\Users\bilgee\AppData\Local\Microsoft\WindowsApps\python3.13.exe C:\projects\discreteMath_report2.py 
5×5 관계행렬을 입력하세요 (각 행은 공백으로 구분된 0 또는 1 다섯 개):
1행: 1 1 0 0 0
1 1 0 0 0
0 0 1 1 0
0 0 1 1 0
0 0 0 0 12행: 3행: 4행: 5행: 
==================================================
▶ 입력된 관계 R
--------------------------------------------------
1 1 0 0 0
1 1 0 0 0
0 0 1 1 0
0 0 1 1 0
0 0 0 0 1
--------------------------------------------------
반사적?   예
대칭적?   예
추이적?   예
⇒ 동치 관계인가?  예
동치류 및 대표자 표시:
  대표자 = 1 : [1, 2]
  대표자 = 3 : [3, 4]
  대표자 = 5 : [5]
집합의 분할:  { {1, 2} | {3, 4} | {5} }

==================================================
▶ 최종 동치폐포 (Equivalence Closure = T(S(R_reflexive)))
--------------------------------------------------
1 1 0 0 0
1 1 0 0 0
0 0 1 1 0
0 0 1 1 0
0 0 0 0 1
--------------------------------------------------
반사적?   예
대칭적?   예
추이적?   예
⇒ 동치 관계인가?  예
동치류 및 대표자 표시:
  대표자 = 1 : [1, 2]
  대표자 = 3 : [3, 4]
  대표자 = 5 : [5]
집합의 분할:  { {1, 2} | {3, 4} | {5} }


종료 코드 0(으)로 완료된 프로세스
